"""
task_6
Пользователь вводит номер буквы в алфавите. Определить, какая это буква."""

a = int(input('Введите номер буквы в алфавите: '))
b = chr(a+96)
print(f'{a} буква в алфавите это: {b}')
